#pragma once

#include <vector>

namespace motor_sequences{

// 8x9の行列としてデータを保存
inline const std::vector<std::vector<float>> pickup_sequence = {
    {155.43f, 205.27f, 143.19f, 7.36f, 5.45f, -77.71f, 39.81f, 468.98f, 535.79f, 214.16f},
    {155.43f, 205.27f, 143.19f, 7.36f, 5.45f, -77.71f, 665.81f, 468.98f, 535.79f, 214.16f},
    {155.43f, 334.27f, 817.19f, -1.64f, 174.45f, 1069.29f, 656.81f, 843.98f, 215.79f, 214.16f},
    {329.43f, 711.27f, 977.19f, 324.36f, 213.45f, 1220.29f, 656.81f, 843.98f, 215.79f, 214.16f},
    {321.43f, 717.27f, 1107.19f, 332.36f, 667.45f, 1174.29f, 665.81f, 324.98f, 209.79f, 214.16f}
};

} //namespace motor_sequences