#pragma once

#include <vector>

namespace motor_sequences{

// 8x9の行列としてデータを保存
inline const std::vector<std::vector<float>> pickup_sequence = {
    {168.00f, 237.00f, 178.00f, 10.00f, 16.00f, -85.00f, 42.00f, 471.00f, 527.00f, 160.00f},
    {168.00f, 237.00f, 178.00f, 10.00f, 16.00f, -85.00f, 668.00f, 471.00f, 527.00f, 160.00f},
    {168.00f, 366.00f, 852.00f, 1.00f, 185.00f, 1062.00f, 659.00f, 846.00f, 207.00f, 160.00f},
    {342.00f, 743.00f, 1012.00f, 327.00f, 224.00f, 1213.00f, 659.00f, 846.00f, 207.00f, 160.00f},
    {334.00f, 749.00f, 1142.00f, 335.00f, 678.00f, 1167.00f, 668.00f, 327.00f, 201.00f, 160.00f}
};

} //namespace motor_sequences